import Image from "next/image";
import Container from "../common/Container";
import Link from "next/link";

const newsList = [
  {
    id: 1,
    title: "সোহরাওয়ার্দী উদ্যান অভিযানে মারধর: চার পুলিশ সদস্য প্রত্যাহার",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান পরিচালনার সময় শিক্ষার্থীদের সঙ্গে পুলিশের সংঘর্ষের ঘটনা ঘটেছে। প্রত্যক্ষদর্শীরা জানান, অভিযানের সময় কয়েকজন শিক্ষার্থীকে মারধরের অভিযোগ ওঠে। ঘটনার ভিডিও সামাজিক মাধ্যমে ছড়িয়ে পড়লে ব্যাপক সমালোচনা শুরু হয়। পরে পুলিশ সদর দপ্তর থেকে চারজন সদস্যকে সাময়িকভাবে প্রত্যাহার করা হয়েছে এবং একটি তদন্ত কমিটি গঠন করা হয়েছে। সংশ্লিষ্ট কর্তৃপক্ষ জানিয়েছে, তদন্ত শেষে প্রয়োজনীয় ব্যবস্থা নেওয়া হবে।",
    image:
      "https://images.unsplash.com/photo-1526304640581-d334cdbbf45e?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 2,
    title: "রাষ্ট্রপতির প্রেস সচিব পদে আবারও সরওয়ার আলম",
    desc: "সাবেক অতিরিক্ত সচিব সরওয়ার আলম আবারও রাষ্ট্রপতির প্রেস সচিব পদে...",
    details:
      "সাবেক অতিরিক্ত সচিব সরওয়ার আলমকে পুনরায় রাষ্ট্রপতির প্রেস সচিব হিসেবে নিয়োগ দেওয়া হয়েছে। জনপ্রশাসন মন্ত্রণালয় থেকে জারি করা প্রজ্ঞাপনে এ তথ্য জানানো হয়। এর আগে তিনি একই পদে সফলতার সঙ্গে দায়িত্ব পালন করেন। সংশ্লিষ্ট সূত্র জানিয়েছে, রাষ্ট্রপতির কার্যালয়ের গণমাধ্যম কার্যক্রম আরও গতিশীল করতে এই নিয়োগ দেওয়া হয়েছে।",
    image:
      "https://images.unsplash.com/photo-1540747913346-19e32dc3e97e?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 3,
    title: "নতুন আইজিপি হলেন আলী হোসেন ফকির",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "সরকার আলী হোসেন ফকিরকে দেশের নতুন পুলিশ মহাপরিদর্শক (আইজিপি) হিসেবে নিয়োগ দিয়েছে। স্বরাষ্ট্র মন্ত্রণালয়ের এক প্রজ্ঞাপনে এই নিয়োগের কথা জানানো হয়। তিনি দীর্ঘদিন ধরে বিভিন্ন গুরুত্বপূর্ণ পদে দায়িত্ব পালন করেছেন। নতুন দায়িত্ব গ্রহণ করে তিনি আইনশৃঙ্খলা পরিস্থিতি আরও উন্নত করার অঙ্গীকার ব্যক্ত করেছেন।",
    image:
      "https://images.unsplash.com/photo-1556228720-195a672e8a03?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 4,
    title: "শেষপর্যন্ত হচ্ছে না গণভোট, ২ এপ্রিল দুই আসনে উপনির্বাচন: ইসি",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "নির্বাচন কমিশন জানিয়েছে, নির্ধারিত সময়ে গণভোট অনুষ্ঠিত হচ্ছে না। পরিবর্তে আগামী ২ এপ্রিল দুইটি শূন্য আসনে উপনির্বাচন অনুষ্ঠিত হবে। ইসি সচিবালয় জানিয়েছে, প্রস্তুতি ইতোমধ্যে শুরু হয়েছে এবং সংশ্লিষ্ট প্রশাসনকে প্রয়োজনীয় নির্দেশনা দেওয়া হয়েছে।",
    image:
      "https://images.unsplash.com/photo-1451187580459-43490279c0fa?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 5,
    title: "১০ মার্চ ফ্যামিলি কার্ড বিতরণ উদ্বোধন করবেন তারেক রহমান",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "আগামী ১০ মার্চ ফ্যামিলি কার্ড বিতরণ কর্মসূচির উদ্বোধন করবেন দলের ভারপ্রাপ্ত চেয়ারম্যান তারেক রহমান। দলীয় সূত্রে জানা গেছে, এই কর্মসূচির মাধ্যমে নিম্ন আয়ের পরিবারগুলোকে সহায়তা প্রদান করা হবে। সারাদেশে ধাপে ধাপে কার্ড বিতরণ কার্যক্রম পরিচালিত হবে।",
    image:
      "https://images.unsplash.com/photo-1540747913346-19e32dc3e97e?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 6,
    title: "২৬ ফেব্রুয়ারি শুরু অমর একুশে বইমেলা, উদ্বোধন করবেন প্রধানমন্ত্রী",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "বাংলা একাডেমি প্রাঙ্গণে ২৬ ফেব্রুয়ারি শুরু হচ্ছে অমর একুশে বইমেলা। প্রধানমন্ত্রী ভার্চুয়ালি এই মেলার উদ্বোধন করবেন। আয়োজকরা জানিয়েছেন, এবারের মেলায় নতুন বইয়ের সংখ্যা বেড়েছে এবং নিরাপত্তা ব্যবস্থাও জোরদার করা হয়েছে।",
    image:
      "https://images.unsplash.com/photo-1544620347-c4fd4a3d5957?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 7,
    title: "মেয়াদ অনুযায়ী ধাপে ধাপে সিটি করপোরেশন নির্বাচন হবে: মির্জা ফখরুল",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "বিএনপি মহাসচিব মির্জা ফখরুল ইসলাম আলমগীর বলেছেন, মেয়াদ শেষ হওয়ার ভিত্তিতে ধাপে ধাপে সিটি করপোরেশন নির্বাচন অনুষ্ঠিত হবে। তিনি অবাধ ও সুষ্ঠু নির্বাচনের দাবি জানান এবং নির্বাচন কমিশনের নিরপেক্ষ ভূমিকা কামনা করেন।",
    image:
      "https://images.unsplash.com/photo-1451187580459-43490279c0fa?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 8,
    title: "ফের এলপি গ্যাসের দাম নির্ধারণ, কমলো ১৫ টাকা",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে ",
    details:
      "বাংলাদেশ এনার্জি রেগুলেটরি কমিশন (বিইআরসি) এলপি গ্যাসের নতুন দাম ঘোষণা করেছে। নতুন ঘোষণায় প্রতি সিলিন্ডারে ১৫ টাকা কমানো হয়েছে। আগামী মাস থেকে এই মূল্য কার্যকর হবে বলে জানানো হয়েছে।",
    image:
      "https://images.unsplash.com/photo-1556228720-195a672e8a03?q=80&w=1000&auto=format&fit=crop",
  },
  {
    id: 9,
    title: "মেয়াদ অনুযায়ী ধাপে ধাপে সিটি করপোরেশন নির্বাচন হবে: মির্জা ফখরুল",
    desc: "রাজধানীর সোহরাওয়ার্দী উদ্যানে মাদকবিরোধী অভিযান চালাকালে...",
    details:
      "সিটি করপোরেশন নির্বাচন নিয়ে রাজনৈতিক অঙ্গনে আলোচনা চলছে। দলীয় নেতারা জানিয়েছেন, নির্ধারিত সময় অনুযায়ী নির্বাচন আয়োজন করা হবে এবং ভোটারদের নিরাপত্তা নিশ্চিত করা হবে।",
    image:
      "https://images.unsplash.com/photo-1451187580459-43490279c0fa?q=80&w=1000&auto=format&fit=crop",
  },
];


export default function TrendingNews() {
  return (
    <Container className="">
      <div className="   ">
        <div className="grid md:grid-cols-3 gap-2 md:gap-4 lg:gap-6">
          {newsList?.slice(0, 6)?.map((news, i) => (
            <div key={i} className="flex justify-between gap-2 border-b pb-4 cursor-pointer group">

              {/* Text */}
              <div className="flex-1">
                <Link href={`/`} className="text-gray-600 text-lg md:text-[22px] leading-[24px] md:leading-[26px] group-hover:text-primary font-semibold ">
                  {news.title}
                </Link>


                <p className="text-gray-500 text-base md:text-xl mt-2 line-clamp-2 md:line-clamp-3">
                  {news?.details}
                </p>

              </div>

              {/* Image Right Side */}
              <div className="w-[120px] h-[100px] lg:w-[200px] lg:h-[150px] relative flex-shrink-0">
                <Image
                  src={news.image}
                  alt={news.title}
                  fill
                  className="object-cover"
                />
              </div>
            </div>

          ))}
        </div>
        {/* <div className="grid md:grid-cols-4 gap-2 mt-4 ">
          {newsList?.slice(1,9)?.map((news, i) => (
            <div key={i} className="flex justify-between gap-4 border-b py-3 cursor-pointer group">
           
              
                  <div className="flex-1">
                    <h3 className="text-gray-950 text-base md:text-[22px]  group-hover:text-red-600 ">
                      {news.title}
                    </h3>

                  </div>

               
                  <div className="w-[150px] h-[90px] relative flex-shrink-0">
                    <Image
                      src={news.image}
                      alt={news.title}
                      fill
                      className="object-cover"
                    />
                  </div>
                </div>
           
          ))}
        </div> */}
      </div>
    </Container>
  );
}